import React, {Component} from 'react';
import {ScrollView, StyleSheet, Text, View} from 'react-native';

type Props = {
  navigation: any,
  route: any,
}

export default class UserAgreementPage extends Component<Props> {

  render() {
    return (
        <View style={styles.wrapper}>
          <ScrollView style={{flex: 1}}>
            <View style={styles.content}>
              <Text style={styles.title}>锦绣通途《用户协议及隐私政策》</Text>
              <Text style={styles.contentTxt}>
                尊敬的用户：{'\n'}
                {'    '}在您成为<Text style={styles.bold}>锦绣通途</Text>注册用户，使用<Text style={styles.bold}>使用锦绣通途</Text>提供的服务之前，请您认真阅读本《用户协议及隐私政策》，更好的了解我们所提供的服务以及您享有的权利和承担的义务。您一旦开始使用<Text style={styles.bold}>锦绣通途</Text>，即表示您已经确认并接受了本文件中的全部条款。
                {'\n\n'}
                <Text style={styles.title}>第一部分 用户协议</Text>{'\n'}
                本用户协议（以下简称“协议”）系由您（以下简称“用户”或“您”）与珠海市通途劳务派遣有限公司（以下简称“锦绣通途公司” 或“我们”）就珠海市通途劳务派遣有限公司提供的<Text style={styles.bold}>锦绣通途软件</Text>所订立的相关权利义务规范。{'\n'}
                <Text style={styles.bold}>锦绣通途</Text>是一个严肃纯净的招聘服务软件，请您在注册、使用软件之前，认真阅读以下条款：{'\n'}
                <Text style={styles.bold}>一、注册条款的接受</Text>{'\n'}
                一旦您在注册页面点击或勾选“阅读并同意接受用户协议及隐私政策”相关内容后，即表示您已经阅读并且同意与锦绣通途达成协议，成为锦绣通途的用户，并接受本用户协议中的全部注册条款以及第二部分《个人信息保护政策》和锦绣通途软件内公布的其他专项协议或规则的所有条款的约束。{'\n'}
                <Text style={styles.bold}>二、用户注册条件</Text>{'\n'}
                1、在注册之日必须年满18周岁以上。{'\n'}
                2、为了更好地享有锦绣通途网络信息发布平台服务，用户应遵守锦绣通途软件注册机制的要求，向锦绣通途提供本人真实、正确、最新及完整的资料。{'\n'}
                3、若用户提供任何错误、不实或不完整的资料，或锦绣通途有理由怀疑资料为错误、不实或不完整及违反用户注册条款的，或锦绣通途有理由怀疑其用户资料、言行等有悖于软件主题或违反规则的，锦绣通途有权修改用户的注册昵称、个人说明、发布的信息等，或暂停或终止该用户使用其帐号，或暂停或终止提供锦绣通途提供的全部或部分服务。{'\n'}
                4、若用户故意提供虚假的身份信息，视为严重违反本用户协议，锦绣通途有权暂停或终止该用户账号并停止提供服务。虚假注册、发布虚假信息给锦绣通途造成经济、名誉等任何损失的，锦绣通途将追究该用户的法律责任。{'\n'}
                <Text style={styles.bold}>三、用户帐号、密码及安全</Text>{'\n'}
                1、在完成用户注册程序之后，用户将收到一个密码及帐号。用户有义务保证密码及帐号的安全。用户应对利用该密码及帐号所进行的一切活动负全部责任，包括任何经由锦绣通途上载、张贴、发送电子邮件或任何其它方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息或其它资料，无论系公开还是私下传送，均由内容提供者承担责任。{'\n'}
                2、用户的密码或帐号遭到未获授权的使用，或者发生其它任何安全问题时，用户应立即通知锦绣通途。由于用户使用不当或者其他非因锦绣通途导致的帐号、密码泄漏，进而导致其资料、信息泄漏的，由用户承担其不利后果。{'\n'}
                3、用户不得将账号主动告知第三方或提供给第三方进行使用，如因此造成用户隐私泄露或锦绣通途平台损失的，用户应当承担相应的责任。{'\n'}
                <Text style={styles.bold}>四、服务说明</Text>{'\n'}
                1、锦绣通途通过国际互联网为用户提供网络服务，包括在线及离线的相关业务。为使用网络服务，用户应自行配备进入国际互联网所必需的设备，包括计算机、数据机或其它存取装置，并自行支付登陆国际互联网所需要的费用。{'\n'}
                2、锦绣通途在提供网络服务时，可能会对部分网络服务收取一定的费用，在此情况下，会在相关页面上做明确的提示。如用户拒绝支付该等费用，则不能使用相关的网络服务。付费业务将在本注册条款的基础上另行规定服务条款，以规范付费业务的内容和双方的权利义务，用户应认真阅读，如用户购买付费业务，则视为接受付费业务的服务条款。{'\n'}
                3、无论是付费服务还是锦绣通途的免费服务均有有效期，有效期结束后服务将自动终止，且有效期不可中断或延期。除非本注册条款或其他相关服务条款另有规定，所有付费业务均不退费。{'\n'}
                4、对于利用锦绣通途进行非法活动，或其言行（无论线上或者线下的）背离锦绣通途目的的，锦绣通途将严肃处理，包括将其列入黑名单、将其被投诉的情形公之于众、删除用户帐号等处罚措施，给锦绣通途造成经济或者名誉等任何损失的，锦绣通途将追究其法律责任。{'\n'}
                5、锦绣通途有权向其用户发送广告信，或为活动等目的，向其用户发送电子邮件、短信或电话通知。除系统通知或重要信息外，用户可以通过锦绣通途提供的方式选择不接收上述信息。{'\n'}
                6、用户应通过锦绣通途软件使用相关服务，未经许可，不得通过其他第三方工具或运营平台获取锦绣通途服务，包括但不限于通过第三方软件登录锦绣通途账号等。如因用户使用第三方软件导致相关信息泄漏的，锦绣通途不承担任何责任，且用户还应承担由此给锦绣通途造成的损失。{'\n'}
                <Text style={styles.bold}>五、有限责任条款</Text>{'\n'}
                1、锦绣通途将尽力为用户提供提供安全、及时、准确、高质量的服务，但不保证一定能满足用户的要求和期望，也不保证服务不会中断，对服务的及时性、安全性、准确性都不作保证。除非另有约定，否则用户因无法使用锦绣通途服务，或使用服务未达到心理预期的，锦绣通途不承担责任。{'\n'}
                2、对于用户通过锦绣通途提供的服务传送的内容，锦绣通途会尽合理努力按照国家有关规定严格审查，但无法完全控制经由软件/网站服务传送的内容，不保证内容的正确性、完整性或品质。因此用户在使用锦绣通途服务时，可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，锦绣通途均不为用户经由软件/网站服务以张贴、发送电子邮件或其它方式传送的任何内容负责。但锦绣通途有权依法停止传输任何前述内容并采取相应行动，包括但不限于暂停用户使用软件/网站服务的全部或部分，保存有关记录，并根据国家法律法规、相关政策在必要时向有关机关报告并配合有关机关的行动。{'\n'}
                3、对于锦绣通途提供的各种第三方广告信息、链接、资讯等（如有），锦绣通途不保证其内容的正确性、合法性或可靠性，相关责任由广告主承担；并且，对于用户经由锦绣通途服务与广告主进行联系或商业往来，完全属于用户和广告主之间的行为，与锦绣通途无关。对于前述商业往来所产生的任何损害或损失，锦绣通途不承担任何责任。{'\n'}
                4、对于用户上传的照片、资料、证件、视频、内容及图片等，锦绣通途已采用相关措施并已尽合理努力进行审核，但不保证其内容的正确性、合法性或可靠性，相关责任由上传上述内容的用户承担。{'\n'}
                5、用户应对锦绣通途上的其他用户发布的内容自行加以判断，并承担因使用内容而引起的所有风险，包括但不限于因对内容的正确性、完整性或实用性的依赖而产生的风险。锦绣通途无法且不会对因前述风险而导致的任何损失或损害承担责任。{'\n'}
                6、是否使用软件/网站服务下载或取得任何资料应由用户自行考虑并自负风险，因任何资料的下载而导致的用户电脑系统的任何损坏或数据丢失等后果，锦绣通途不承担任何责任。{'\n'}
                7、对于锦绣通途在线上或线下策划、发起、组织或是承办的任何相关的活动（包括但不限于收取费用以及完全公益的活动），锦绣通途不对上述招聘效果向用户作出任何保证或承诺，也不担保活动期间用户自身行为的合法性、合理性。由此产生的任何对于用户个人或者他人的人身或者是名誉以及其他损害，应由行为实施主体承担责任。{'\n'}
                8、对于用户的投诉，锦绣通途将尽合理努力进行核实和处理，但不保证一定能满足投诉者的要求。锦绣通途有权决定是否向公众或向被投诉者公开投诉内容。对于投诉内容侵犯用户隐私权、名誉权等合法权利的，所有法律责任由投诉者承担，与锦绣通途无关。{'\n'}
                <Text style={styles.bold}>六、用户权利</Text>{'\n'}
                用户对于自己的个人信息享有以下权利：{'\n'}
                1、随时查询及请求阅览，但因极少数特殊情况（如被网站加入黑名单等）无法查询及提供阅览的除外；{'\n'}
                2、随时请求补充或更正，但因极少数特殊情况（如网站或有关机关为司法程序保全证据等）无法补充或更正的除外；{'\n'}
                3、随时请求注销锦绣通途账号。关于注销帐号的相关规则和流程，请参见《用户注销协议》。您注销成功后，我们将根据法律法规的要求尽快删除您的个人信息或作匿名化处理。{'\n'}
                <Text style={styles.bold}>七、用户应承诺其平台使用行为遵守以下规定</Text>{'\n'}
                1、本协议所称“平台使用”是指用户使用锦绣通途软件服务所进行的任何行为，包括但不限于注册、登录、认证、查看消息、账号管理、发布人才需求信息、以及其他通过锦绣通途账号在锦绣通途平台所进行的一切行为。{'\n'}
                2、锦绣通途提醒用户在使用锦绣通途软件服务时，应遵守《中华人民共和国合同法》《中华人民共和国著作权法》《全国人民代表大会常务委员会关于维护互联网安全的决定》《中华人民共和国保守国家秘密法》《中华人民共和国电信条例》《中华人民共和国计算机信息系统安全保护条例》《中华人民共和国计算机信息网络国际联网管理暂行规定》及其实施办法、《计算机信息系统国际联网保密管理规定》《互联网信息服务管理办法》、《计算机信息网络国际联网安全保护管理办法》《互联网电子公告服务管理规定》《网络安全法》《中华人民共和国劳动法》及《中华人民共和国劳动合同法》《网络信息内容生态治理规定》等相关中国法律法规的规定。{'\n'}
                3、在任何情况下，如果锦绣通途有理由认为用户使用锦绣通途软件服务过程中的任何行为，包括但不限于用户的任何言论和其它行为违反或可能违反上述法律和法规的任何规定，锦绣通途可在任何时候不经任何事先通知终止向该用户提供服务。{'\n'}
                4、用户承诺在使用锦绣通途期间，遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等 七条底线 {'\n'}
                <Text style={styles.bold}>八、禁止用户利用锦绣通途从事下列行为</Text>{'\n'}
                通过锦绣通途的服务时在锦绣通途软件上或者利用锦绣通途的服务制作、复制、发布、传播违反国家相关法律法规及七条底线 、九不准管理规定的违法和不良信息，主要表现为：{'\n'}
                1、反对宪法所确定的基本原则的；{'\n'}
                2、危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；{'\n'}
                3、损害国家荣誉和利益的；煽动民族仇恨、民族歧视、破坏民族团结的；{'\n'}
                4、破坏国家宗教政策，宣扬邪教和封建迷信的；{'\n'}
                5、散布谣言，扰乱社会秩序，破坏社会稳定的；{'\n'}
                6、散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；{'\n'}
                7、侮辱或者诽谤他人，侵害他人合法权利的；{'\n'}
                8、含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或有悖道德、令人反感的内容；{'\n'}
                9、含有中国法律、法规、规章、条例以及任何具有法律效力的规范所限制或禁止的其它内容的。{'\n'}
                10、使用锦绣通途服务的过程中，以任何方式危害未成年人的利益。{'\n'}
                11、冒充任何人或机构，包含但不限于冒充锦绣通途工作人员或以虚伪不实的方式陈述或谎称与任何人或机构有关的。{'\n'}
                12、将侵犯任何人的肖像权、名誉权、隐私权、专权、商标权、著作权、商业秘密或其它专属权利的内容上载、张贴、发送电子邮件或以其它方式传送的。{'\n'}
                13、将病毒或其它计算机代码、档案和程序，加以上载、张贴、发送电子邮件或以其它方式传送的。{'\n'}
                14、跟踪或以其它方式骚扰其他用户的。{'\n'}
                15、未经合法授权而截获、篡改、收集、储存或删除他人个人信息、电子邮件或其它数据资料，或将获知的此类资料用于任何非法或不正当目的。{'\n'}
                16、以任何方式干扰或企图干扰锦绣通途的任何产品、任何部分或功能的正常运行，或者制作、发布、传播上述工具、方法等。{'\n'}
                17、未能按照锦绣通途平台的流程、规则进行注册、认证或使用本服务的，违反本服务功能限制或运营策略，或采取任何措施规避前述流程、规则、限制或策略的。{'\n'}
                18、未经锦绣通途的许可使用插件、外挂或通过其他第三方工具、运营平台或任何服务接入本服务和相关系统的。{'\n'}
                19、利用锦绣通途账号从事，包括但不限于欺诈、传销、刷流量、好评、违法物品营销等任何违法兼职或犯罪活动的。{'\n'}
                20、仿冒、混淆他人账号昵称、头像、功能介绍或发布招聘内容等，或冒充、利用他人名义对外招聘的。{'\n'}
                21、未经锦绣通途的许可，以任何目的自行或授权、允许、协助任何第三人对平台内的任何信息内容进行非法获取，用于商业用途或其他任何目的。“非法获取”是指采用包括但不限于“蜘蛛”(SPIDER)程序、爬虫程序、拟人程序等非真实用户或避开、破坏技术措施等非正常浏览的手段、方式，读取、复制、转存、获得数据和信息内容的行为。{'\n'}
                22、为任何注册用户或非注册用户提供自动登录到锦绣通途平台、代办或协助他人代办身份认证服务的或代售身份认证所需的相关材料或凭据等.{'\n'}
                23、其他任何导致或可能导致锦绣通途与第三方产生纠纷、争议或诉讼的行为。{'\n'}
                <Text style={styles.bold}>九、特别规定</Text>{'\n'}
                1、用户如违反本协议第八条，锦绣通途有权在任何时候不经任何事先通知暂停或终止向该用户提供服务。{'\n'}
                2、用户有下列行为或存在下述情形的，锦绣通途在发现或接到投诉后，有权采取冻结用户账户或以其他方式暂停向该用户提供服务，并要求用户承担相应的损害赔偿责任：{'\n'}
                （1）发布了涉及广告（寻求合作）、传销或直销等内容{'\n'}
                （2）发布了涉及色情、淫秽内容{'\n'}
                （3）发布了涉及违法/政治敏感内容{'\n'}
                （4）发布虚假信息，包括但不限于不真实的公司信息、项目需求、个人资历等{'\n'}
                （5）利用锦绣通途提供的服务索取他人隐私{'\n'}
                （6）发布涉及人身攻击或其他侵害他人权益的内容{'\n'}
                （7）骚扰其他用户{'\n'}
                （8）发布不符合锦绣通途相关服务性质的信息，如鸡汤、段子、水贴等{'\n'}
                （9）涉嫌拖欠/未按法律规定支付薪资/劳务报酬的，或涉嫌具有其他可能损害劳动者或劳务人员合法权益的。（涉及农民工或涉众的均属于“情节严重”）本平台有权对前述情形进行处置，相关判断方式包括但不限于因上述行为被列入相关政府部门“黑名单”、被多名用户举报投诉或被新闻媒体曝光等情形{'\n'}
                （10）其他违反法律法规或国家政策以及损害锦绣通途及其合法用户之合法权益的行为{'\n'}
                3、根据我国现行的法律法规等相关规定，如用户实施前述第（4）项“发布虚假信息”的，包括但不限于用户发布的项目需求信息与其实际需求不符的，人才实际与发布的信息不符，如用户实际的需求为“保险销售、信用卡销售、理财产品销售、地产中介或销售或劳务派遣”，与其发布的项目需求信息在内容、类型或其他方面并非一致或对应的甚至不存在，锦绣通途随时有权拒绝向该用户提供服务，并可采取其他处理措施，包括但不限于“永久性封禁账号”、“永久性将其设备号、手机号等相关信息冻结”或“永久性加入‘黑名单’”等。{'\n'}
                <Text style={styles.bold}>十、隐私政策</Text>{'\n'}
                锦绣通途依法保护用户个人信息和隐私信息。有关隐私政策的内容，详见本协议的第二部分 《个人信息保护政策》。{'\n'}
                <Text style={styles.bold}>十一、关于用户在锦绣通途的上传或张贴的内容</Text>{'\n'}
                1、用户在锦绣通途上传或张贴的内容（包括但不限于照片、文字、评价等），视为用户授予锦绣通途及其关联公司免费、非独家的使用权，锦绣通途有权为展示、传播及推广前述张贴内容的目的，对上述内容进行复制、修改、出版等。该使用权持续至用户书面通知锦绣通途不得继续使用，且锦绣通途实际收到该等书面通知时止。{'\n'}
                2、因用户上传或张贴的内容侵犯他人权利，而导致任何第三方向锦绣通途提出侵权或索赔要求的，用户应承担全部责任。{'\n'}
                3、任何第三方对于用户在锦绣通途的公开使用区域张贴的内容进行复制、修改、编辑、传播等行为的，该行为产生的法律后果和责任均由行为人承担，与锦绣通途无关。{'\n'}
                <Text style={styles.bold}>十二、关于立即沟通等即时通讯服务</Text>{'\n'}
                1、用户在接受锦绣通途提供与锦绣通途注册用户或锦绣通途企业或人才方用户进行在线立即沟通等即时通讯服务时，应当遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚，并保证所传输的信息真实性等七条底线。{'\n'}
                2、用户通过锦绣通途提供的通讯服务，与其他用户进行线上沟通过程中所产生的文字、语音及视频等相关信息，如咨询、沟通的聊天记录等，锦绣通途可能会根据法律规定、处理用户的投诉举报或安全风控的需要进行临时存储，并可能根据实际情况随时进行删除。锦绣通途会对相关信息进行加密处理，除法律强制要求外，不向任何第三人泄露。{'\n'}
                3、锦绣通途不临时存储的信息将仅用于处理投诉、诈骗检测、用户离线暂存用途。{'\n'}
                4、为保护其他用户隐私，用户不得将本条规定的其他用户通讯信息，如聊天记录等，对外进行公布。如因此造成锦绣通途损失，或者侵害其他用户权利的，应当承担违约责任或赔偿责任。{'\n'}
                <Text style={styles.bold}>十三、信息储存和限制</Text>{'\n'}
                锦绣通途有权制定一般措施及限制，包含但不限于软件服务将保留的电子邮件、聊天讯息、所张贴内容或其他上载内容的最长期间、每个账号可收发沟通讯息的最大数量及可收发的单个消息的大小。通过服务存储或传送之任何信息、通讯资料和其他内容，如被删除或未予储存，锦绣通途不承担任何责任。用户同意，长时间未使用的账号，锦绣通途有权关闭。同时锦绣通途有权自行决定并无论通知用户与否，随时变更这些一般措施及限制。{'\n'}
                <Text style={styles.bold}>十四、结束服务</Text>{'\n'}
                用户若反对任何注册条款的内容或对之后注册条款修改有异议，或对锦绣通途服务不满，用户有以下权利：不再使用锦绣通途服务；结束用户使用锦绣通途服务的资格；通知锦绣通途停止该用户的服务。结束用户服务的同时，用户使用锦绣通途服务的权利立即终止，锦绣通途不再对用户承担任何义务。{'\n'}
                <Text style={styles.bold}>十五、禁止商业行为</Text>{'\n'}
                1、用户同意不对锦绣通途提供的服务或服务的任何部分，进行复制、拷贝、出售、转售或用于任何其他商业目的。{'\n'}
                2、禁止企业或需求方向人才方私下付费，如有不实，我们将结束用户使用锦绣通途服务的资格，并在平台公布纳入黑名单。{'\n'}
                <Text style={styles.bold}>十六、违约责任</Text>{'\n'}
                1、用户使用虚假的身份信息、公司信息进行注册，发布虚假项目信息，发布含有传销、色情、反动等严重违法内容，对外传播即时聊天等通讯记录等行为，视为严重违反本协议，应当承担给锦绣通途造成的经济损失和名誉损失。{'\n'}
                2、因用户通过锦绣通途提供的服务提供、张贴或传送内容、违反本服务条款、或侵害他人任何权利而导致任何第三人对锦绣通途提出任何索赔或请求，用户应当赔偿锦绣通途或其他合作伙伴的损失，包括但不限于赔偿金额、律师费和合理的调查费用等。{'\n'}
                3、用户在投诉其他用户有违法行为或违反本注册条款情形时，投诉者应承担不实投诉所产生的全部法律责任。如侵犯他人的合法权益，投诉人应独立承担全部法律责任。如给锦绣通途造成损失的，投诉人应对锦绣通途承担相应的赔偿责任。{'\n'}
                <Text style={styles.bold}>十七、本协议条款的变更和修改</Text>{'\n'}
                锦绣通途有权依法随时对本协议的任何条款进行变更和修改。一旦发生条款变动，我们将在锦绣通途软件内进行更新及提示，或将最新版本的《用户协议及隐私政策》以系统消息、弹窗或邮件的形式发送给用户阅读及确认接收。用户如果不同意条款的修改，应主动停止使用锦绣通途或申请注销锦绣通途账号，如未使用的付费权益将在注销后清空。否则，如果用户继续使用用户账号，则视为用户已经接受本协议全部条款的修改。{'\n'}
                <Text style={styles.bold}>十八、不可抗力</Text>{'\n'}
                1、不可抗力”是指锦绣通途不能合理控制、不可预见或即使预见亦无法避免的事件，该事件妨碍、影响或延误锦绣通途根据本注册条款履行其全部或部分义务。该事件包括但不限于政府行为、自然灾害、战争、黑客袭击、电脑病毒、网络故障等。不可抗力可能导致锦绣通途无法访问、访问速度缓慢、存储数据丢失、用户个人信息泄漏等不利后果。{'\n'}
                2、遭受不可抗力事件时，锦绣通途可中止履行本用户协议项下的义务直至不可抗力的影响消除为止，并且不因此承担违约责任；但应尽最大努力克服该事件，减轻其负面影响。{'\n'}
                <Text style={styles.bold}>十九、通知</Text>{'\n'}
                锦绣通途向其用户发出的通知，将采用系统消息、弹窗、电子邮件或页面公告等形式。本《用户协议及隐私政策》的条款修改或其他事项变更时，锦绣通途可以以上述形式进行通知。{'\n'}
                <Text style={styles.bold}>二十、法律的适用和管辖</Text>{'\n'}
                本协议的生效、履行、解释及争议的解决均适用中华人民共和国的现行法律，所发生的争议应提交仲裁委员会，其仲裁裁决是终局的。本用户协议因与中华人民共和国现行法律相抵触而导致部分条款无效的，不影响其他条款的效力。
                {'\n\n'}
                <Text style={styles.title}>第二部分 《个人信息保护政策》</Text>{'\n'}
                欢迎您使用我们的产品和服务！我们非常重视您的隐私保护和个人信息保护。本《个人信息保护政策》将帮助您了解以下内容:{'\n'}
                <Text style={styles.bold}>一、引言</Text>{'\n'}
                为了切实保护锦绣通途用户隐私权，优化用户体验，锦绣通途根据现行法规及政策，制定本《个人信息保护政策》。本《个人信息保护政策》将详细说明锦绣通途在获取、管理及保护用户个人信息方面的政策及措施。本《个人信息保护政策》适用于锦绣通途向您提供的所有服务，无论您是通过计算机设备、移动终端或其他设备获得的锦绣通途软件服务。{'\n'}
                本《个人信息保护政策》旨在帮助您了解我们会收集哪些数据、为什么收集这些数据，会利用这些数据做些什么及如何保护这些数据。我们希望您在使用锦绣通途软件服务前仔细阅读并明确您已经充分理解、接受本《个人信息保护政策》的内容，希望您可以根据自己的理解做出合适的选择。您一旦开始使用锦绣通途软件平台服务，即表示您认同本《个人信息保护政策》中所述内容。在我们更新本《个人信息保护政策》后，您继续使用我们的产品与/或服务，即意味着您同意本《个人信息保护政策》(含更新版本)内容，并且同意我们按照本《个人信息保护政策》收集、使用、保存和共享您的相关信息。此外，当我们将您的个人信息用于本《个人信息保护政策》未涵盖的用途时，我们会事先征求您的同意。{'\n'}
                <Text style={styles.bold}>二、我们如何收集和使用您的个人信息</Text>{'\n'}
                （1）主要功能及相关个人信息{'\n'}
                在您使用锦绣通途提供的以下服务或功能过程中，我们将收集以下必要的相关个人信息。{'\n'}
                1、验证成为注册用户{'\n'}
                您首先需要注册一个锦绣通途账号成为锦绣通途的注册用户。当您注册时，您需要向我们提供您本人的手机号码，我们将通过发送短信验证码的方式来验证您的身份是否有效。{'\n'}
                （二）改进产品和保障用户安全的相关信息{'\n'}
                为了增强锦绣通途软件平台的过程中的安全性，尽可能保障您或其他用户在过程中的人身、财产安全免遭侵害，我们会收集必要的不涉及到您的个人身份等隐私的信息，包括：{'\n'}
                1、我们可能会收集您网络服务相关的日志信息，如<Text style={styles.bold}>IP地址、某按钮的点击使用时间和频率、某页面的使用时间和频率、某些关键配置的选项值、崩溃日志、错误日志</Text>，用于将您感兴趣的项目需求、人才信息或过程中您可能需要的服务信息展示给您，同时有可能用于统计我们产品的用户数量、分析产品的使用状况、网页升级改版、浏览器兼容性检测、排查崩溃原因、减少崩溃情况。{'\n'}
                2、为了验证您的身份信息，防止他人未经授权访问您的帐号，我们会在您授权同意后，获取您的手机设备识别码权限，访问您的手机设备型号、IP地址、设备软件版本信息、设备标识符。否则将无法利用身份信息验证的方式保障您的账户安全。{'\n'}
                3、我们可能会利用手机信息（包括您的<Text style={styles.bold}>手机号、邮箱地址</Text>），用于用户之间在线咨询等功能。同时，客服在接受、响应您的咨询、投诉前，会使用您的账号或实名信息核验您的身份。{'\n'}
                （三）需要您授权同意调取系统权限的情形{'\n'}
                基于用户人身安全之考虑，以及满足互联网平台服务普遍存在的风控需求，锦绣通途的附加业务功能可能需要您先同意我们调取相关的系统权限以使用您的个人信息。您可通过手机设备上的“我的-设置-隐私设置-权限管理”逐项查看具体的个人信息访问权限及其开启状态，并决定开启或关闭这些权限。若开启这些权限即代表您授权我们收集和使用这些个人信息：{'\n'}
                1、读取设备权限{'\n'}
                当您使用android版本的锦绣通途时，我们会首次向您申请获取设备权限，目的是正常识别您的<Text style={styles.bold}>手机设备识别码</Text>，以满足风控、审计需求。若您拒绝，我们可能无法保障您正常使用基本业务功能。{'\n'}
                2、读取存储权限{'\n'}
                当您使用android版本的锦绣通途、完善注册信息时，在您同意开启<Text style={styles.bold}>外部存储权限</Text>后，才可从本地上传图片、照片或文档至锦绣通途进行头像设置等操作。否则，您将无法使用与存储卡读取或缓存相关的功能，但您仍可进入锦绣通途继续完善您的注册信息。{'\n'}
                3、访问相机权限{'\n'}
                我们访问您的相机是为了您可使用直接拍摄并上传图片{'\n'}
                4、开启定位权限{'\n'}
                我们承诺仅收集您所处的<Text style={styles.bold}>位置信息</Text>，例如您所在的省、市、区（县），而不会追踪您的行踪轨迹。如果拒绝开启位置信息，您仍可使用其他业务功能。{'\n'}
                5、访问相册权限{'\n'}
                通过开启允许访问相册功能，您可以直接选择手机相册内图片上传展示。{'\n'}
                6、访问通讯录权限{'\n'}
                为您实现邀请手机<Text style={styles.bold}>通讯录</Text>好友加入，需要在您同意授权后，开通此权限，实现您直接从通讯录中选择并导入选定联系人。在此权限下，我们仅会访问您主动选择的<Text style={styles.bold}>联系人信息</Text>，不会收集、使用或存储您的通讯录中其他的联系人信息。{'\n'}
                7、开启通知权限{'\n'}
                为了能够及时向您发送服务通知，我们会在您授权同意后获取该权限，如果不授权该权限，您将无法接收到锦绣通途向您推送通知的提醒，但不影响其他功能使用。{'\n'}
                8、访问日历权限{'\n'}
                我们访问您的日历，是为了向您提供预约等相关功能，并通过您的手机日历将时间添加至日程安排。{'\n'}
                9、访问麦克风权限{'\n'}
                我们访问您的麦克风是为了在您与其他用户进行在线沟通时发送语音消息或使用语音转文字功能。我们只会在为您提供特定的业务场景下申请麦克风权限。在您同意开启麦克风权限后，只有您主动点击相关图标时，我们才会通过麦克风功能获取语音信息。{'\n'}
                关闭上述系统权限，即代表您撤回这些授权，则我们将不再继续收集和使用您的这些个人信息，但也无法为您提供与这些授权所对应的相关功能。上述权限的关闭决定并不会影响此前基于您的授权所进行的个人信息的处理。{'\n'}
                （四）通过第三方SDK收集信息的情形{'\n'}
                锦绣通途的部分附加业务服务或功能，需要使用第三方SDK来协助完成，或者由第三方SDK来直接提供相关服务。这些SDK可能会收集或使用您的以下个人信息，我们会以弹窗或其他形式另行通知，在您授权同意后再获取相关信息。如未取得您的授权，我们将不会收集和使用相关信息，也不会再反复弹窗向您获取授权。目前这些SDK包括：{'\n'}
                1、极验SDK、数盟SDK、阿里免验证码登录SDK、腾讯httpDNS{'\n'}
                为保障本软件业务安全风控，应对账户被盗用、DNS被劫持等 ，我们会使用前述列举的相关SDK。在您授权同意后，获取访问您的<Text style={styles.bold}>本机设备信息和MAC地址</Text>权限。如您拒绝授权，则可能影响您的账户安全。{'\n'}
                2、活体认证SDK（腾讯/阿里云/FACE++）{'\n'}
                为了落实《网络安全法》关于身份审核的法律规定及行业约定，用户可能需要<Text style={styles.bold}>人脸识别</Text>验证。我们在您授权同意后，获取您的本机摄像头、相册以及麦克风权限，如不授予该权限，您将无法通过实名认证，但可继续使用其他服务。{'\n'}
                <Text style={styles.bold}>三、我们如何共享、转让、公开披露您的个人信息</Text>{'\n'}
                我们不会向第三方共享、转让您的个人信息，除非经过您本人事先授权同意，或者共享、转让的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体。{'\n'}
                （一）共享{'\n'}
                我们会以高度的勤勉义务对待您的信息。除以下情形外，未经您同意，我们不会与除锦绣通途及其关联公司外的任何第三方公司、组织和个人分享您的信息：{'\n'}
                1、为实现特定功能而与业务合作伙伴共享{'\n'}
                当软件服务提供商、智能设备提供商或系统服务提供商与我们联合为您提供服务时，当您需要使用<Text style={styles.bold}>地理位置</Text>功能时，为实现这一功能，我们可能会收集您的位置信息或相关设备信息（包括<Text style={styles.bold}>硬件型号、操作系统版本号、国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC）</Text>）并经“去标识化”后提供给前述提供商。我们的授权合作伙伴包括以下类型：{'\n'}
                （1）服务平台或服务提供商。锦绣通途各产品接入了丰富的第三方服务。当您选择使用该第三方服务时，您授权我们将该信息提供给第三方服务平台或服务提供商，以便其基于相关信息为您提供服务，包括认证服务提供商，当您绑定锦绣通途与认证平台账号时，我们将弹出授权确认页面，在向您告知收集上述信息并得到您授权的情况下，我们可能会将您的信息提供给认证平台，用于审核您的信用状况。{'\n'}
                （2）软硬件/系统服务提供商。当第三方软硬件/系统产品或服务与锦绣通途的产品或服务结合为您提供服务时，经您授权，我们会向第三方软硬件/系统服务提供商提供您必要的个人信息，以便您使用服务，或用于我们分析产品和服务使用情况，来提升您的使用体验2、我们承诺在共享过程中，尽最大可能保障您的数据和隐私不受侵害，并以不低于本《个人信息保护政策》所要求的保密和安全措施来处理该些信息。如果您拒绝本条款的内容，请通过本《个人信息保护政策》公布的联系方式与我们联系。{'\n'}
                3、我们与之共享个人信息的其他公司、组织和个人（如有），我们会与其签署严格的保密协议，并要求第三方以不低于本《个人信息保护政策》所要求的保密和安全措施来处理该些信息。{'\n'}
                （二）转让{'\n'}
                我们不会将您的个人信息转让给除锦绣通途及其关联公司外的任何公司、组织和个人，但以下情形除外：{'\n'}
                1、事先获得您的明确授权或同意；{'\n'}
                2、满足法律法规、法律程序的要求或强制性的政府要求或司法裁定；{'\n'}
                3、如果我们或我们的关联公司涉及合并、分立、清算、资产或业务的收购或出售等交易，您的个人信息有可能作为此类交易的一部分而被转移，我们将确保该等信息在转移时的机密性，并要求新的持有您个人信息的公司、组织继续受此个人信息保护政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。{'\n'}
                （三）公开披露{'\n'}
                我们仅会在以下情形下，公开披露您的个人信息：{'\n'}
                1、获得您的明确同意；{'\n'}
                2、基于法律法规、法律程序、诉讼或政府主管部门强制性要求下。{'\n'}
                （四）例外情形{'\n'}
                在以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：{'\n'}
                1、与国家安全、国防安全直接相关的；{'\n'}
                2、与公共安全、公共卫生、重大公共利益直接相关的；{'\n'}
                3、与犯罪侦查、起诉、审判和判决执行等直接相关的；{'\n'}
                4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；{'\n'}
                5、您自行向社会公众公开的个人信息；{'\n'}
                6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。{'\n'}
                7、根据个人信息主体要求签订和履行合同所必需的；{'\n'}
                8、用于维护所提供的产品或服务的安全稳定运行所必需的，包括发现、处置产品或服务的故障；{'\n'}
                9、法律法规规定的其他情形。{'\n'}
                10、根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。{'\n'}
                <Text style={styles.bold}>四、我们如何保存及保护您的个人信息</Text>{'\n'}
                (一) 保存信息{'\n'}
                1、信息存储{'\n'}
                您在使用锦绣通途产品及服务期间，我们将持续为您保存您的个人信息。如果您注销账户或主动删除上述信息，我们将依据《网络安全法》等相关法律法规的规定保存您的信息。在您注销帐户或主动删除上述信息后，我们不会再对您的个人信息进行商业化使用，但我们可能会对您的个人信息进行删除或匿名化处理后使用。{'\n'}
                2、保存地域{'\n'}
                您的个人信息均储存于中华人民共和国境内。（如需向境外传输您的个人信息，我们会严格按照法律法规的规定执行，并保证您的个人信息安全。）{'\n'}
                3、例外情况{'\n'}
                一般而言，我们仅为实现目的所必需的合理时间保留您的个人信息，下列情况下，我们有可能因需符合法律要求，更改个人信息的存储时间：{'\n'}
                （1）为遵守法律法规等有关规定的适用；{'\n'}
                （2）为遵守法院判决、裁定或其他法律程序的规定；{'\n'}
                （3）为遵守相关政府机关或法定授权组织的要求；{'\n'}
                （4）我们有理由确信需要遵守法律法规等有关规定；{'\n'}
                （5）为执行相关服务协议或本《个人信息保护政策》维护社会公共利益{'\n'}
                （6）为保护我们及我们的客户、用户或雇员的人身财产安全；{'\n'}
                （7）其他合法权益所合理必需的用途。{'\n'}
                4、当我们的产品或服务发生停止运营的情形时，我们将采取例如，推送通知、公告等形式通知您，并在合理的期限内删除或匿名化处理您的个人信息。{'\n'}
                (二) 保护措施{'\n'}
                1、我们已采取符合业界标准、合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。{'\n'}
                2、我们从组织建设、制度设计、人员管理、产品技术等方面多维度提升整个系统的安全性。{'\n'}
                3、我们会采取合理可行的措施，尽力避免收集无关的个人信息。我们只会在达成本《个人信息保护政策》所述目的所需的期限内保留您的个人信息（除非法律有强制的存留要求）。{'\n'}
                4、互联网并非绝对安全的环境，使用锦绣通途平台服务时，我们强烈建议您不要使用非锦绣通途平台推荐的通信方式发送您的信息。您可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、分享时，您可以自主选择沟通、分享的对象，作为能够看到您的联络方式、交流信息或分享内容等相关信息的第三方。{'\n'}
                5、在使用锦绣通途平台服务进行沟通时，请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即通过公布的联系方式联络我们，以便我们根据您的申请采取相应措施。{'\n'}
                6、请注意，您在使用我们平台服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，如您在评论、沟通时选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。{'\n'}
                (三) 安全事件通知{'\n'}
                1、我们会制定网络安全事件应急预案，及时处置系统漏洞、计算机病毒、网络攻击、网络侵入等安全风险，在发生危害网络安全的事件时，我们会立即启动应急预案，采取相应的补救措施，并按照规定向有关主管部门报告。{'\n'}
                2、个人信息泄露、毁损、丢失属于公司级特大安全事件，我们会负责定期组织工作组成员进行安全预案演练，防止此类安全事件发生。若一旦不幸发生，我们将按照最高优先级启动应急预案，在最短时间内追溯原因并减少损失。{'\n'}
                3、在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时通过软件内部提醒、邮件、短信或电话等方式向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处理措施、您可自主防范和降低的风险的建议、对您的补救措施等。我们将及时将事件相关情况通过上述方式告知您，难以逐一告知时我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。{'\n'}
                我们将不定期更新并公开安全风险、个人信息安全影响评估报告等有关内容，您可通过锦绣通途公告、短信或系统推送等方式获得。{'\n'}
                <Text style={styles.bold}>五、您的权利</Text>{'\n'}
                按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：{'\n'}
                (一) 访问和修改您的个人信息{'\n'}
                1、如果您无法通过上述链接访问该等个人信息，您可以通过本《个人信息保护政策》公布的联系方式与我们联系。{'\n'}
                2、您在使用我们的产品和服务过程中产生的其他个人信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请通过本《个人信息保护政策》的公布的联系方式与我们联系。{'\n'}
                3、您发现我们处理的关于您的个人信息有错误时，您有权对错误或不完整的信息作出更正或更新，您可以通过上述段落中列明的方式提出更正或补充申请。为保障安全，我们将在您行使更正权前对您的身份进行验证。{'\n'}
                (二) 删除您的个人信息{'\n'}
                在以下情形中，您可以向我们提出删除个人信息的请求，您可以通过“修改您的个人信息”中列明的方式或本《个人信息保护政策》公布的联系方式随时与我们联系：{'\n'}
                1、如果我们违反法律法规或与您的约定收集、使用、与他人共享或转让您的个人信息；{'\n'}
                2、如果我们违反法律法规规定或与您的约定，公开披露您的个人信息，您有权要求我们立即停止公开披露的行为，并发布通知要求相关接收方删除相应的信息。{'\n'}
                3、我们没有征求您的明确同意，收集了您的个人信息。{'\n'}
                4、我们违反了与您的约定来使用和处理您的个人信息。{'\n'}
                5、您注销了锦绣通途帐号、卸载或者不再使用我们的产品（或服务）。{'\n'}
                6、我们停止对您提供服务。{'\n'}
                (三) 改变授权范围{'\n'}
                1、改变或撤回敏感信息权限{'\n'}
                您可以在设备本身操作系统中关闭地理位置、通讯录、摄像头、麦克风等权限改变同意范围或撤回您的授权。{'\n'}
                2、拒绝接受推送及营销信息{'\n'}
                您可以通过手机设置关闭“推送通知”拒绝消息的推送，通过回复“TD”可退订我们的营销短信。{'\n'}
                3、请您理解，特定的业务功能和服务将需要您的信息才能完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也将不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的同意或授权而开展的个人信息处理。{'\n'}
                (四) 注销您的账户{'\n'}
                您可以在我们产品的“帮助与反馈”中直接申请注销账户，也可以通过本《个人信息保护政策》公布的联系方式，申请注销锦绣通途账号。需要注意的是，我们为了保护您或他人的合法权益、履行互联网平台的法律责任，在您的账号处于特殊状态下，虽然我们会支持您的请求，但您在成功注销后可能无法再次注册或使用锦绣通途和服务，具体事项以《注销协议》为准。{'\n'}
                (五) 提前获知产品和服务停止运营{'\n'}
                锦绣通途愿一直陪伴您，若因特殊原因导致锦绣通途平台被迫停止运营，我们将按照法律法规的要求，在产品和/或服务的主页面或站内信或向您发送电子邮件或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的个人信息进行删除或匿名化处理等。{'\n'}
                (六) 响应您的上述请求{'\n'}
                1、为保障安全，您需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。{'\n'}
                2、对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。{'\n'}
                (七) 响应请求的例外{'\n'}
                在以下情形中，按照法律法规要求，我们将无法响应您的上述请求：{'\n'}
                1、与国家安全、国防安全直接相关的；{'\n'}
                2、与公共安全、公共卫生、重大公共利益直接相关的{'\n'}
                3、与犯罪侦查、起诉、审判和执行判决等直接相关的{'\n'}
                4、证据表明您可能存在明显恶意、滥用权力及占用平台资源的（如您的请求将危害公共安全）{'\n'}
                5、您和其他人合法权益，或您的请求超出了一般技术手段和商业成本可覆盖的范围；{'\n'}
                6、响应个人信息主体的请求将导致您或其他个人、组织的合法权益受到严重损害的；{'\n'}
                7、涉及商业秘密的。{'\n'}
                <Text style={styles.bold}>六、我们如何处理未成年人的个人信息</Text>{'\n'}
                锦绣通途非常重视对未成年人信息的保护。{'\n'}
                基于我们的软件服务的性质，我们不向16周岁以下的未成年人提供服务。若您是已满16周岁不满18周岁的未成年人，建议您请您的监护人仔细阅读本《个人信息保护政策》，并在征得您的监护人同意的前提下使用我们的产品和/或服务或向我们提供信息。{'\n'}
                如您的监护人不同意您按照本《个人信息保护政策》使用我们的服务或向我们提供信息，请您立即终止使用我们的服务并及时通知我们，以便我们采取相应的措施。{'\n'}
                如果监护人发现我们在未获监护人同意的情况下收集了未成年人的个人信息，请通过本《个人信息保护政策》公布的联系方式联系我们，我们会尽快删除相关数据。{'\n'}
                <Text style={styles.bold}>七、您的个人信息如何进行跨境转移</Text>{'\n'}
                原则上，我们在中国境内收集和产生的个人信息仅存储在中国境内。如部分产品或服务涉及跨境，我们需要向境外传输您的个人信息，我们会严格按照法律法规的规定执行，并保证您的个人信息安全。{'\n'}
                <Text style={styles.bold}>八、本《个人信息保护政策》的更新</Text>{'\n'}
                我们可能适时修订本《个人信息保护政策》内容。如该等变更会导致您在本《个人信息保护政策》项下权利的实质变化，我们将在变更生效前，通过系统推送、电子邮件、短信或页面公告等方式通知您。{'\n'}
                若您不同意该等变更应停止使用锦绣通途平台产品和服务，或通过本《个人信息保护政策》公布的联系方式要求暂时封停您的账号。若您继续使用我们的产品或服务，即表示您同意受修订后的本《个人信息保护政策》的约束；{'\n'}
                本《个人信息保护政策》所指的重大变更包括但不限于：{'\n'}
                1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；{'\n'}
                2、个人信息共享、转让或公开披露的主要对象发生变化；{'\n'}
                3、您参与个人信息处理方面的权利及其行使方式发生重大变化；{'\n'}
                4、其他可能对您的个人信息权益产生重大影响的变化时；{'\n'}
                5、个人信息出境情况发生变更时。{'\n'}
                <Text style={styles.bold}>九、如何联系我们</Text>{'\n'}
                如果您对本《个人信息保护政策》及我们对您的个人信息的处理有任何疑问、意见、建议，请通过“联系我们”或“帮助和反馈”与我们联系。一般情况下，我们会在15日内对您的请求予以答复。 {'\n'}
                <Text style={styles.bold}>十、争议解决</Text>{'\n'}
                本《个人信息保护政策》与《锦绣通途用户协议及隐私政策》共同构成您使用锦绣通途服务的基本协议文件。本《个人信息保护政策》适用中华人民共和国现行法律法规。与本《个人信息保护政策》相关的争议，如果您对我们的回复或解决方案不满意，需要通过法律途径解决的，应将该争议提交至中山仲裁委员会，其仲裁裁决是终局的。{'\n'}
                <Text style={styles.bold}>附录：定义</Text>{'\n'}
                本《个人信息保护政策》中使用的特定词语，具有如下含义：{'\n'}
                1.“我们”或“锦绣通途”，指珠海市锦绣通途派遣有限公司。{'\n'}
                2.“您”或“用户”，指使用珠海市锦绣通途派遣有限公司运营的锦绣通途科技产业软件平台服务的注册用户。{'\n'}
                3.“锦绣通途”或“锦绣通途软件”，指锦绣通途手机客户端、锦绣通途微信小程序。{'\n'}
                4.“个人信息”，指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。个人信息包括个人基本信息、个人身份信息、个人生物识别信息、网络身份标识信息、个人健康生理信息、个人教育工作信息、个人财产信息、个人通信信息、联系人信息、个人上网记录、个人常用设备信息、个人位置信息等。为免疑义，个人信息包括但不限于个人敏感信息。{'\n'}
                5.“个人信息主体”，指个人信息所标识的自然人。{'\n'}
                <Text style={styles.bold}>6.“个人敏感信息”，指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。个人敏感信息包括个人财产信息、个人健康生理信息、个人生物识别信息、个人身份信息、网络身份标识信息等。</Text>{'\n'}
                7.“去标识化”，指通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。{'\n'}
                8.“匿名化”，指通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。{'\n'}
                9.“中国”或“中国境内”，指中华人民共和国大陆地区，仅为本《个人信息保护政策》之目的，不包含香港特别行政区、澳门特别行政区和台湾地区。
              </Text>
            </View>
          </ScrollView>
        </View>
    );
  }
}

const styles = StyleSheet.create({
  wrapper: {
    flex: 1,
    justifyContent: "center",
    alignItems: "stretch",
    backgroundColor: "#FFF",
  },
  content: {
    paddingHorizontal: 12,
    paddingVertical: 18,
    backgroundColor: "#FFF",
  },
  title: {
    fontSize: 16,
    color: "#333333",
    fontWeight: "bold",
    marginBottom: 12,
  },
  contentTxt: {
    fontSize: 14,
    color: "#102A25",
    lineHeight: 25,
  },
  bold: {
    fontWeight: "bold",
  }
});